## S-Expressions

这种语法有一个名字：这些被称为 s-表达式（s 是出于历史原因）。在 plait 中，我们将用反引号（`` ` ``）前缀这些表达式。反引号后跟 Racket 项的类型是 `S-Exp`。以下是一些 s-表达式的示例：

```
`1
`2.3
`-40
```

这些都是数值 s-表达式。我们也可以写

```
`{+ 1 2}
`{+ 1 {+ 2 3}}
```

这并不明显，但实际上这些都是列表 s-表达式。我们可以通过询问

```
> (s-exp-list? `1)
- Boolean
#f
> (s-exp-list? `{+ 1 2})
- Boolean
#t
> (s-exp-list? `{+ 1 {+ 2 3}})
- Boolean
#t
```

所以第一个不是，但后两个是；同样地，

```
> (s-exp-number? `1)
- Boolean
#t
> (s-exp-number? `{+ 1 {+ 2 3}})
- Boolean
#f
```

`S-Exp` 类型是实际数字或列表的容器，我们可以从中提取：

```
> (s-exp->number `1)
- Number
1
> (s-exp->list `{+ 1 2})
- (Listof S-Exp)
(list `+ `1 `2)
```

现在就做：如果你将 `s-exp->number` 应用到一个列表 s-表达式或 `s-exp->list` 应用到一个数值 s-表达式会发生什么？或者应用到根本不是 s-表达式的东西上？现在就试一试，看看结果如何！你得到的结果是否有些不同？

让我们更仔细地看看上面的最后一个输出。结果列表有三个元素，其中两个是数字，但第三个是其他东西：

```
`+
```

是一个符号表达式。符号像字符串，但在操作和性能上有所不同。虽然有很多字符串操作（如子字符串），但符号被视为原子；除了转换为字符串外，它们只支持其他一种操作，即相等性。但作为回报，符号可以在常数时间内检查相等性。

符号具有与 Racket 变量相同的语法，因此非常适合表示类似变量的东西。因此

```
> (s-exp-symbol? `+)
- Boolean
#t
> (s-exp->symbol `+)
- Symbol
'+
```

这个输出显示了在 Racket 中符号的写法：使用单引号 (`'`)。

还有其他类型的 s-表达式，但现在我们只需要这些！有了这个，我们就可以编写我们的第一个解析器了！
